nix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-25 Wed 23:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Managing Emacs with Nix</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T. Gustafsson. Theme: Copyright (c) 2019 [[https://github.com/gongzhitaao/orgcss][gongzhitaao]]gongzhitaao." />
<link rel="stylesheet" type="text/css" href="https://kinnala.github.io/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Managing Emacs with Nix</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc5465c3">1. Introduction</a></li>
<li><a href="#org2f21307">2. Emacs configuration</a></li>
<li><a href="#orgad28f05">3. Overlay for Emacs</a></li>
<li><a href="#org031da1a">4. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5465c3" class="outline-2">
<h2 id="orgc5465c3"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Recently I discovered <a href="https://nixos.org/nix/">Nix</a>, the purely functional package manager, via a
colleague.  I spent some evenings reading about it, felt convinced, and during
the holidays defined my development environment using Nix.
I'm now running Ubuntu 19.10 with development-related software installed
using Nix.
</p>
</div>
</div>

<div id="outline-container-org2f21307" class="outline-2">
<h2 id="org2f21307"><span class="section-number-2">2</span> Emacs configuration</h2>
<div class="outline-text-2" id="text-2">
<p>
I was able to reuse my <a href="https://github.com/kinnala/emacs.d">Emacs configuration</a> previously based on straight.el and
use-package macros.  I deleted the straight.el bootstrapping code and
straight.el-specific extensions in use-package macros.
There wasn't any particular issue with straight.el but I felt that
the features relevant to me were already covered by Nix.
</p>
</div>
</div>

<div id="outline-container-orgad28f05" class="outline-2">
<h2 id="orgad28f05"><span class="section-number-2">3</span> Overlay for Emacs</h2>
<div class="outline-text-2" id="text-3">
<p>
Next I created a Nix overlay which installs Emacs with various packages from
Elpa/Melpa (with versions defined in the official nixpkgs) and barfs my init.el
to the resulting package:
</p>
<div class="org-src-container">
<pre class="src src-nix">self: super: {
<span style="color: #9B9B9B; background-color: #ededdc;"> </span> <span style="color: #BA36A5;">emacs_config</span> = self.writeText <span style="color: #008000;">"default.el"</span> (builtins.readFile <span style="color: #D0372D;">./init.el</span>);
<span style="color: #9B9B9B; background-color: #ededdc;"> </span> <span style="color: #BA36A5;">emacs</span> = self.emacsWithPackages (epkgs: (<span style="color: #0000FF;">with</span> epkgs.melpaPackages; [
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   use-package
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   hydra
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   ivy
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   counsel
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   swiper
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   transient
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   magit
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   which-key
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   exec-path-from-shell
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   expand-region
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   multiple-cursors
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   json-mode
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   leuven-theme
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   highlight-indentation
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   yaml-mode
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   wgrep
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   phi-search
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   docker
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   restclient
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   ob-restclient
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   htmlize
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   diredfl
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   python-pytest
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   dired-k
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   nix-mode
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   anaconda-mode
<span style="color: #9B9B9B; background-color: #ededdc;"> </span> ]) ++ (<span style="color: #0000FF;">with</span> epkgs.elpaPackages; [
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   csv-mode
<span style="color: #9B9B9B; background-color: #ededdc;"> </span>   org
<span style="color: #9B9B9B; background-color: #ededdc;"> </span> ]) ++ [ (self.runCommand <span style="color: #008000;">"default.el"</span> {} <span style="color: #008000;">''</span>
<span style="color: #008000;">mkdir -p $out/share/emacs/site-lisp</span>
<span style="color: #008000;">cp </span><span style="color: #808080;">${</span>self.emacs_config<span style="color: #808080;">}</span><span style="color: #008000;"> $out/share/emacs/site-lisp/default.el</span>
<span style="color: #008000;">''</span>) ]);
}
</pre>
</div>
<p>
The overlay "redefines" the package <code>emacs</code> in the official repositories with
something that has the additional packages and my configuration included.
This file should be put to <code>$HOME/.config/nixpkgs/overlays</code> together with <code>init.el</code>
so that it is automatically used commands like <code>nix-env</code>.
Installing (or reinstalling) the overlay can be done by
</p>
<div class="org-src-container">
<pre class="src src-sh">nix-env -iA nixpkgs.emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-org031da1a" class="outline-2">
<h2 id="org031da1a"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
In future I might look into <a href="https://github.com/nix-community/emacs-overlay">nix-community/emacs-overlay</a> to get more recent Melpa
packages as this approach is pinned to the versions defined in the official
Nixpkgs repository.  However, for now I've been happy with this new approach
and installing the same environment to another computer has been a breeze.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: T. Gustafsson. Theme: Copyright (c) 2019 <a href="https://github.com/gongzhitaao/orgcss">gongzhitaao</a>.</p>
<p class="date">Created: 2019-12-25 Wed 23:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
